In [1]:
import pandas as pd
import numpy as np

In [22]:
exam_data  = {'nom': ['Anne', 'Alex', 'catherine', 'Jean', 'Emillie', 'Michel', 'Matieu', 'Laura', 'Kevin', 'Jonas'],
        'note': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
              'moyenne' : [12.0, 9, 16.0, 5.0, 9.0, 20.0, 14.0, 15.0, 8.0, 19.0],
        'qualification': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
         'profession': ['boulanger', 'chanteur', 'boulanger', 'cuisinier', 'conducteur', 'cuisinier', 'livreur', 'pilote de ligne', 'mécanicien', np.NAN]}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

In [14]:
df.dtypes

nom               object
note             float64
moyenne          float64
qualification     object
profession        object
dtype: object

In [15]:
# Vérifions si il y a des val null ? différence entre l'index : 10 entries et les nombres indiqués
# sur chaque ligne
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 5 columns):
nom              10 non-null object
note             8 non-null float64
moyenne          10 non-null float64
qualification    10 non-null object
profession       9 non-null object
dtypes: float64(2), object(3)
memory usage: 480.0+ bytes

In [16]:
df

         nom  note  moyenne qualification       profession
a       Anne  12.5     12.0           yes        boulanger
b       Alex   9.0      9.0            no         chanteur
c  catherine  16.5     16.0           yes        boulanger
d       Jean   NaN      5.0            no        cuisinier
e    Emillie   9.0      9.0            no       conducteur
f     Michel  20.0     20.0           yes        cuisinier
g     Matieu  14.5     14.0           yes          livreur
h      Laura   NaN     15.0            no  pilote de ligne
i      Kevin   8.0      8.0            no       mécanicien
j      Jonas  19.0     19.0           yes              NaN

In [24]:
# Il faut d'abord traiter nos données en remplacant les Nan
df["note"].fillna(0,inplace=True)

In [25]:
df["profession"].fillna("Sans emploi",inplace=True)

In [19]:
df

         nom  note  moyenne qualification       profession
a       Anne  12.5     12.0           yes        boulanger
b       Alex   9.0      9.0            no         chanteur
c  catherine  16.5     16.0           yes        boulanger
d       Jean   0.0      5.0            no        cuisinier
e    Emillie   9.0      9.0            no       conducteur
f     Michel  20.0     20.0           yes        cuisinier
g     Matieu  14.5     14.0           yes          livreur
h      Laura   0.0     15.0            no  pilote de ligne
i      Kevin   8.0      8.0            no       mécanicien
j      Jonas  19.0     19.0           yes      Sans emploi

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 5 columns):
nom              10 non-null object
note             10 non-null float64
moyenne          10 non-null float64
qualification    10 non-null object
profession       10 non-null object
dtypes: float64(2), object(3)
memory usage: 480.0+ bytes

In [28]:
df["moyenne"].astype("int")

a    12
b     9
c    16
d     5
e     9
f    20
g    14
h    15
i     8
j    19
Name: moyenne, dtype: int32

In [29]:
df

         nom  note  moyenne qualification       profession
a       Anne  12.5     12.0           yes        boulanger
b       Alex   9.0      9.0            no         chanteur
c  catherine  16.5     16.0           yes        boulanger
d       Jean   0.0      5.0            no        cuisinier
e    Emillie   9.0      9.0            no       conducteur
f     Michel  20.0     20.0           yes        cuisinier
g     Matieu  14.5     14.0           yes          livreur
h      Laura   0.0     15.0            no  pilote de ligne
i      Kevin   8.0      8.0            no       mécanicien
j      Jonas  19.0     19.0           yes      Sans emploi

In [30]:
# pas de paramètre inplace
# donc 
df["moyenne"] = df["moyenne"].astype("int")

In [31]:
df

         nom  note  moyenne qualification       profession
a       Anne  12.5       12           yes        boulanger
b       Alex   9.0        9            no         chanteur
c  catherine  16.5       16           yes        boulanger
d       Jean   0.0        5            no        cuisinier
e    Emillie   9.0        9            no       conducteur
f     Michel  20.0       20           yes        cuisinier
g     Matieu  14.5       14           yes          livreur
h      Laura   0.0       15            no  pilote de ligne
i      Kevin   8.0        8            no       mécanicien
j      Jonas  19.0       19           yes      Sans emploi

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 5 columns):
nom              10 non-null object
note             10 non-null float64
moyenne          10 non-null int32
qualification    10 non-null object
profession       10 non-null object
dtypes: float64(1), int32(1), object(3)
memory usage: 760.0+ bytes

In [33]:
df["profession"].nunique()

8

In [34]:
df["profession"] = df["profession"].astype("category")

In [35]:
df["qualification"] = df["qualification"].astype("category")

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 5 columns):
nom              10 non-null object
note             10 non-null float64
moyenne          10 non-null int32
qualification    10 non-null category
profession       10 non-null category
dtypes: category(2), float64(1), int32(1), object(1)
memory usage: 1.1+ KB